/*
* \copyright (C) 2026 Puzikova V.V.
* \file      cut_cells.h
* \author    Puzikova Valeria (vvp) 
* \date      31.05.2026 10:11:37
* \brief     cut_cells.h
* \fmtstyle  3S
*/

#ifndef _LS_STAG_CUT_CELLS_H_
#define _LS_STAG_CUT_CELLS_H_

// ================================================================== INCLUDES
// ================================================================== SYNOPSIS
/*!
\file
\brief Заголовочный файл с описанием перечисления CellTypes

Данный файл содержит в себе перечисление типов усеченных ячеек CellTypes для трехмерного случая
*/
// ===========================================================================

namespace LS_STAG
{	
	/// Типы усеченных ячеек
	enum CellTypes
	{
		UnknownCell = -1,///< Неизвестен
		SolidCell,     ///< 0 --- полностью твёрдая ячейка
		// жидкая часть --- тетраэдр (1 вершина ячейки в жидкости)
		TNW_Tetrahedron =        1,///< В-С-З тетраэдр
		TNE_Tetrahedron =       10,///< В-С-В тетраэдр
		TSE_Tetrahedron =      100,///< В-Ю-В тетраэдр
		TSW_Tetrahedron =     1000,///< В-Ю-З тетраэдр
		BNW_Tetrahedron =    10000,///< Н-С-З тетраэдр
		BNE_Tetrahedron =   100000,///< Н-С-В тетраэдр
		BSE_Tetrahedron =  1000000,///< Н-Ю-В тетраэдр
		BSW_Tetrahedron = 10000000,///< Н-Ю-З тетраэдр
		// жидкая часть --- пентаэдр (2 вершины ячейки в жидкости)
		TN_Pentahedron =       11,///< В-С пентаэдр
		TE_Pentahedron =      110,///< В-В пентаэдр
		TW_Pentahedron =     1001,///< В-З пентаэдр
		TS_Pentahedron =     1100,///< В-Ю пентаэдр
		NW_Pentahedron =    10001,///< C-З пентаэдр
		NE_Pentahedron =   100010,///< C-B пентаэдр
		BN_Pentahedron =   110000,///< Н-С пентаэдр
		SE_Pentahedron =  1000100,///< Ю-B пентаэдр
		BE_Pentahedron =  1100000,///< Н-В пентаэдр
		SW_Pentahedron = 10001000,///< Ю-З пентаэдр
		BW_Pentahedron = 10010000,///< Н-З пентаэдр
		BS_Pentahedron = 11000000,///< Н-Ю пентаэдр
		// жидкая часть --- 5-угольный гексаэдр (3 вершины ячейки в жидкости)
		TNTE_Hexahedron5 =      111,///< B-C-B-B 5-угольный гексаэдр
		TNTW_Hexahedron5 =     1011,///< B-C-B-З 5-угольный гексаэдр
		TSTW_Hexahedron5 =     1101,///< B-Ю-B-З 5-угольный гексаэдр
		TSTE_Hexahedron5 =     1110,///< B-Ю-B-B 5-угольный гексаэдр
		TNNW_Hexahedron5 =    10011,///< B-C-C-З 5-угольный гексаэдр
		TWNW_Hexahedron5 =    11001,///< B-З-C-З 5-угольный гексаэдр
		TNNE_Hexahedron5 =   100011,///< B-C-C-B 5-угольный гексаэдр
		TENE_Hexahedron5 =   100110,///< B-B-C-B 5-угольный гексаэдр
		BNNW_Hexahedron5 =   110001,///< H-C-C-З 5-угольный гексаэдр
		BNNE_Hexahedron5 =   110010,///< H-C-C-B 5-угольный гексаэдр
		TESE_Hexahedron5 =  1000110,///< B-B-Ю-B 5-угольный гексаэдр
		TSSE_Hexahedron5 =  1001100,///< B-Ю-Ю-B 5-угольный гексаэдр
		BENE_Hexahedron5 =  1100010,///< Н-B-C-B 5-угольный гексаэдр
		BESE_Hexahedron5 =  1100100,///< Н-B-Ю-B 5-угольный гексаэдр
		BNBE_Hexahedron5 =  1110000,///< Н-C-H-B 5-угольный гексаэдр
		TWSW_Hexahedron5 = 10001001,///< B-З-Ю-З 5-угольный гексаэдр
		TSSW_Hexahedron5 = 10001100,///< B-Ю-Ю-З 5-угольный гексаэдр
		BWNW_Hexahedron5 = 10010001,///< Н-З-C-З 5-угольный гексаэдр
		BWSW_Hexahedron5 = 10011000,///< Н-З-Ю-З 5-угольный гексаэдр
		BNBW_Hexahedron5 = 10110000,///< Н-C-H-З 5-угольный гексаэдр
		BSSE_Hexahedron5 = 11000100,///< H-Ю-Ю-B 5-угольный гексаэдр
		BSSW_Hexahedron5 = 11001000,///< H-Ю-Ю-З 5-угольный гексаэдр
		BSBW_Hexahedron5 = 11010000,///< Н-Ю-H-З 5-угольный гексаэдр
		BSBE_Hexahedron5 = 11100000,///< Н-Ю-H-B 5-угольный гексаэдр
		// жидкая часть --- 4-угольный гексаэдр (4 вершины ячейки с одной грани в жидкости)
		T_Hexahedron4 =     1111,///< В(ерх) 4-угольный гексаэдр
		N_Hexahedron4 =   110011,///< С 4-угольный гексаэдр
		E_Hexahedron4 =  1100110,///< В 4-угольный гексаэдр
		W_Hexahedron4 = 10011001,///< З 4-угольный гексаэдр
		S_Hexahedron4 = 11001100,///< Ю 4-угольный гексаэдр
		B_Hexahedron4 = 11110000,///< Н 4-угольный гексаэдр
		// жидкая часть --- 6-угольный гептаэдр (4 вершины ячейки не с одной грани в жидкости)
		TNW_Heptahedron6 =    11011,///< В-С-З 6-угольный гептаэдр
		TNE_Heptahedron6 =   100111,///< В-С-В 6-угольный гептаэдр
		TSE_Heptahedron6 =  1001110,///< В-Ю-В 6-угольный гептаэдр
		BNE_Heptahedron6 =  1110010,///< Н-С-В 6-угольный гептаэдр
		TSW_Heptahedron6 = 10001101,///< В-Ю-З 6-угольный гептаэдр
		BNW_Heptahedron6 = 10110001,///< Н-С-З 6-угольный гептаэдр
		BSW_Heptahedron6 = 11011000,///< Н-Ю-З 6-угольный гептаэдр
		BSE_Heptahedron6 = 11100100,///< Н-Ю-В 6-угольный гептаэдр
		// жидкая часть --- 5-угольный гептаэдр (5 вершин ячейки в жидкости)
		TNTW_Heptahedron5 =    11111,///< B-C-B-З 5-угольный гептаэдр
		TNTE_Heptahedron5 =   101111,///< B-C-B-B 5-угольный гептаэдр
		TNNE_Heptahedron5 =   110111,///< B-C-C-B 5-угольный гептаэдр
		TNNW_Heptahedron5 =   111011,///< B-C-C-З 5-угольный гептаэдр
		TSTE_Heptahedron5 =  1001111,///< B-Ю-B-B 5-угольный гептаэдр
		TENE_Heptahedron5 =  1100111,///< B-B-C-B 5-угольный гептаэдр
		TESE_Heptahedron5 =  1101110,///< B-B-Ю-B 5-угольный гептаэдр
		BNNE_Heptahedron5 =  1110011,///< H-C-C-B 5-угольный гептаэдр
		BENE_Heptahedron5 =  1110110,///< Н-B-C-B 5-угольный гептаэдр
		TSTW_Heptahedron5 = 10001111,///< B-Ю-B-З 5-угольный гептаэдр
		TWNW_Heptahedron5 = 10011011,///< B-З-C-З 5-угольный гептаэдр
		TWSW_Heptahedron5 = 10011101,///< B-З-Ю-З 5-угольный гептаэдр
		BNNW_Heptahedron5 = 10110011,///< H-C-C-З 5-угольный гептаэдр
		BWNW_Heptahedron5 = 10111001,///< Н-З-C-З 5-угольный гептаэдр
		TSSW_Heptahedron5 = 11001101,///< B-Ю-Ю-З 5-угольный гептаэдр
		TSSE_Heptahedron5 = 11001110,///< B-Ю-Ю-B 5-угольный гептаэдр
		BWSW_Heptahedron5 = 11011001,///< Н-З-Ю-З 5-угольный гептаэдр
		BSSW_Heptahedron5 = 11011100,///< H-Ю-Ю-З 5-угольный гептаэдр
		BESE_Heptahedron5 = 11100110,///< Н-B-Ю-B 5-угольный гептаэдр
		BSSE_Heptahedron5 = 11101100,///< H-Ю-Ю-B 5-угольный гептаэдр
		BNBW_Heptahedron5 = 11110001,///< Н-C-H-З 5-угольный гептаэдр
		BNBE_Heptahedron5 = 11110010,///< Н-C-H-B 5-угольный гептаэдр
		BSBE_Heptahedron5 = 11110100,///< Н-Ю-H-B 5-угольный гептаэдр
		BSBW_Heptahedron5 = 11111000,///< Н-Ю-H-З 5-угольный гептаэдр
		// жидкая часть --- 4-угольный гептаэдр (6 вершин ячейки в жидкости)
		TN_Heptahedron4 =   111111,///< В-С 4-угольный гептаэдр
		TE_Heptahedron4 =  1101111,///< В-В 4-угольный гептаэдр
		NE_Heptahedron4 =  1110111,///< C-B 4-угольный гептаэдр
		TW_Heptahedron4 = 10011111,///< В-З 4-угольный гептаэдр
		NW_Heptahedron4 = 10111011,///< C-З 4-угольный гептаэдр
		TS_Heptahedron4 = 11001111,///< В-Ю 4-угольный гептаэдр
		SW_Heptahedron4 = 11011101,///< Ю-З 4-угольный гептаэдр
		SE_Heptahedron4 = 11101110,///< Ю-B 4-угольный гептаэдр
		BN_Heptahedron4 = 11110011,///< Н-С 4-угольный гептаэдр
		BE_Heptahedron4 = 11110110,///< Н-В 4-угольный гептаэдр
		BW_Heptahedron4 = 11111001,///< Н-З 4-угольный гептаэдр
		BS_Heptahedron4 = 11111100,///< Н-Ю 4-угольный гептаэдр
		// жидкая часть --- 3-угольный гептаэдр (7 вершин ячейки в жидкости)
		TNE_Heptahedron3 =  1111111,///< В-С-В 3-угольный гептаэдр
		TNW_Heptahedron3 = 10111111,///< В-С-З 3-угольный гептаэдр
		TSW_Heptahedron3 = 11011111,///< В-Ю-З 3-угольный гептаэдр
		TSE_Heptahedron3 = 11101111,///< В-Ю-В 3-угольный гептаэдр
		BNE_Heptahedron3 = 11110111,///< Н-С-В 3-угольный гептаэдр
		BNW_Heptahedron3 = 11111011,///< Н-С-З 3-угольный гептаэдр
		BSW_Heptahedron3 = 11111101,///< Н-Ю-З 3-угольный гептаэдр
		BSE_Heptahedron3 = 11111110,///< Н-Ю-З 3-угольный гептаэдр
		// полностью жидкие ячейки
		FluidCell = 11111111,///< полностью жидкая ячейка
		T_Border = -2,       ///< верхняя граница расчётной области
		B_Border = -3,       ///< нижняя граница расчётной области
		N_Border = -4,       ///< северная граница расчётной области
		S_Border = -5,       ///< южная граница расчётной области
		E_Border = -6,       ///< восточная граница расчётной области
		W_Border = -7,       ///< западная граница расчётной области
		TN_Edge = -8,        ///< ВС ребро расчётной области
		TS_Edge = -9,        ///< ВЮ ребро расчётной области
		TE_Edge = -10,       ///< ВВ ребро расчётной области
		TW_Edge = -11,       ///< ВЗ ребро расчётной области
		BN_Edge = -12,       ///< НС ребро расчётной области
		BS_Edge = -13,       ///< НЮ ребро расчётной области
		BE_Edge = -14,       ///< НВ ребро расчётной области
		BW_Edge = -15,       ///< НЗ ребро расчётной области
		NE_Edge = -16,       ///< СВ ребро расчётной области
		NW_Edge = -17,       ///< СЗ ребро расчётной области
		SE_Edge = -18,       ///< ЮВ ребро расчётной области
		SW_Edge = -19,       ///< ЮЗ ребро расчётной области
		TNE_Corner = -20,    ///< ВСВ угол расчётной области
		TNW_Corner = -21,    ///< ВСЗ угол расчётной области
		TSE_Corner = -22,    ///< ВЮВ угол расчётной области
		TSW_Corner = -23,    ///< ВЮЗ угол расчётной области
		BNE_Corner = -24,    ///< НСВ угол расчётной области
		BNW_Corner = -25,    ///< НСЗ угол расчётной области
		BSE_Corner = -26,    ///< НЮВ угол расчётной области
		BSW_Corner = -27     ///< НЮЗ угол расчётной области
	};
}
#endif //_LS_STAG_CUT_CELLS_H_
